README.org
#+title: بِسْمِ اللهِ الرَّحْمنِ الرَّحِيْمِ

* Alquran
.NET lightweight Quran library using the alquran.cloud v1 APIs.
- Dependencies:
  - [[https://www.nuget.org/packages/RestSharp/][RestSharp]] (>= 107.3.0)
  - [[https://www.nuget.org/packages/RestSharp.Serializers.NewtonsoftJson/][RestSharp.Serializers.NewtonsoftJson]] (>= 107.3.0)
This release was built using .NET 6
* Demo
#+begin_src csharp
using alquran;
var e1 = AlQuranV1.Quran(); //getting all of Quran
var e2 = AlQuranV1.Quran("en.asad "); //getting Muhammad Asad's edition of the Holy Quran
var e3 = AlQuranV1.Quran("ar.alafasy "); // getting Mishary Alafasy's recitation of the Quran
#+end_src
* Usage
** ~Edition~
All calls of this methods give you an IEnumerable object of editions describing the filte
editions. From this object, you need to use the identifier to get data from other endpoints
in this API. For any of the endpoints that require an edition identifier, if you do not
specify one, 'quran-uthmani' is used and returns the Arabic text of the Holy Quran.
#+begin_src csharp
IEnumerable<Edition>? Editions(string format, string lang, string type)
#+end_src

*** Parameters
+ ~format~: specify a format. 'text' or 'audio.
+ ~lang~:  a 2 digit language code. Example: 'en', 'fr', etc.
+ ~type~: a valid type. Example - 'versebyverse', 'translation' etc.
*** Cases
Lists all editions for a given language:
#+begin_src csharp
IEnumerable<Edition>? Editions(string lang)
#+end_src
Lists all editions for a given format:
#+begin_src csharp
IEnumerable<Edition>? Editions(string format)
#+end_src
Lists all editions for a given type:
#+begin_src csharp
IEnumerable<Edition>? Editions(string type)
#+end_src
*** Required Parameters
None
*** Default Values
Returns a list of all available editions
*** Example
#+begin_src csharp
var e = AlQuranV1.Editions("audio", "fr", "versebyverse") // Lists all audio editions in french of the versebyverse type
#+end_src
*** Return Type
This methods always returns an ~IEnumerable<edition>~
** ~Quran~
Returns a complete Quran edition in the audio or text format
#+begin_src csharp
Quran? Quran(string edition)
#+end_src
*** Parameters
+ ~edition~: an edition identifier. Example: en.asad for Muhammad Asad's english translation
*** Cases
#+begin_src csharp
Quran? Quran()
#+end_src
Returns the text of the Holy Quran in the quran-uthmani edition.
#+begin_src csharp
Quran? Quran(string edition)
#+end_src
Returns a complete Quran edition.
*** Default Values
Returns the text of the Holy Quran in the quran-uthmani edition.
*** Required Parameters
None
*** Example
#+begin_src csharp
var e1 = AlQuranV1.Quran(); // Returns Muhammad Asad's translation of the Holy Quran
var e2 = AlQuranV1.Quran("en.asad "); // Returns the text of the Holy Quran
var e3 = AlQuranV1.Quran("ar.alafasy "); // Returns Mishary Alafasy's recitation of the Quran
#+end_src
*** Return Type
An object of type ~Quran~
** ~Juz~
The Quran has 30 Juz. You can get the text for each Juz using the method below.
#+begin_src csharp
Juz? Juz(int juz, string edition, int offset, int limit)
#+end_src
*** Parameters
+ ~juz~: number of juz.
+ ~edition~: an edition identifier. Example: en.asad for Muhammad Asad's english translation.
+ ~offset~:  offset ayahs in a juz by the given number.
+ ~limit~: number of ayahs that the response will be limited to.

*** Cases
#+begin_src csharp
Juz? Juz(int juz, string edition)
#+end_src
Returns an object of ~juz~ from edition ~edition~ of the Holy Quran
#+begin_src csharp
Juz? Juz(int juz, string edition, int offset, int limit)
#+end_src
*** Required Parameters
+ ~juz~: number of juz
*** Example
#+begin_src csharp
var e1 = AlQuranV1.Juz(30, "en.asad");
var e2 = AlQuranV1.Juz(30, "quran-uthmani");
var e3 = AlQuranV1.Juz(1, "quran-uthmani", 3, 10);
#+end_src
*** Return Values
An object of type ~Juz~
** ~Surah~
Get a single Surah in one object or in a list with its other ports in other editions of the
Holy Quran.
#+begin_src csharp
object? Surah(int surah, string edition, int offset, int limit)
#+end_src
*** Parameters
+ ~surah~: number of surah
+ ~edition~: an edition identifier. Example: en.asad for Muhammad Asad's english translation.
+ ~offset~:  offset ayahs in a juz by the given number.
+ ~limit~: number of ayahs that the response will be limited to.

*** Cases
#+begin_src csharp
object? Surah(int surah , string edition , int offset , int limit )
#+end_src

Returns an object (castable to ~Surah~ object) of the Surah with number ~surah~, edition
~edition~ and offset ~offset~ to the limit ~limit~.

#+begin_src csharp
object? Surah(int surah)
#+end_src

Returns an object (castable to ~Surah~ object) of Surah with number ~surah~ and edition
~quran-simple~. It will return an object castable to ~IEnumerable<Surah>~ if ~edition~ is
more than 1 edition.

#+begin_src csharp
object? Surah()
#+end_src

Returns an object (castable to ~IEnumerable<Surah>~ object) of all Surahs of the holy Quran

*** Default Value
Returns an object (castable to ~IEnumerable<Surah>~ object) of all Surahs of the holy Quran

*** Required Parameters
None

*** Example
#+begin_src csharp
var e1 = AlQuranV1.Surah() as IEnumerable<Surah>; // all Surahs of Quran
var e2 = AlQuranV1.Surah(114, "ar.alafasy") as Surah; // Returns Mishary Alafasy's recitation of Surat An-Naas
var e3 = AlQuranV1.Surah(3, offset: 4, limit: 7) as Surah; // - Returns verses 2-4 of Surah Al-Fatiha
var e4 = AlQuranV1.Surah(114, "quran-uthmani,en.asad,en.pickthall") as IEnumerable<Surah>; //  Returns Surat An-Naas from 3 editions: Simple Quran, Muhammad Asad and Marmaduke Pickthall
#+end_src
*** Return Value
~object?~

*** Note
Since the ~Surah~ API may return a single Surah, as in example ~e2~ as well it might
returns a list of Surahs, as in examples e1, e4, it return an object type which can be
safely casted to whichever type.

** ~Ayah~
Get a single Ayah in one object or in a list with its other ports in other editions of the
Holy Quran.
#+begin_src csharp
object? Ayah(int ayah, string edition = "")
object? Ayah(int surah, int ayah, string edition = "")
#+end_src
*** Parameters
+ ~ayah~: number of ayah
+ ~surah~: number of surah
+ ~edition~: an edition identifier. Example: en.asad for Muhammad Asad's english translation.
+ ~offset~:  offset ayahs in a juz by the given number.
+ ~limit~: number of ayahs that the response will be limited to.

