README.md

# Table of Contents

1.  [Alquran](#org806e01c)
2.  [Demo](#orgced1d89)
3.  [Usage](#orge055cb5)
    1.  [`Edition`](#orge6a121a)
        1.  [Parameters](#org1dcf1dd)
        2.  [Cases](#orge3fc819)
        3.  [Required Parameters](#org4deb4dd)
        4.  [Default Values](#orgc727dd9)
        5.  [Example](#org1f0ef2b)
        6.  [Return Type](#orgc95d711)
    2.  [`Quran`](#orgb6ea504)
        1.  [Parameters](#orgfec799b)
        2.  [Cases](#org995c4a4)
        3.  [Default Values](#orgf1c4d40)
        4.  [Required Parameters](#org5e7585c)
        5.  [Example](#orgc2aac94)
        6.  [Return Type](#orgf3becbc)
    3.  [`Juz`](#orgba48ee0)
        1.  [Parameters](#orga7d0dc8)
        2.  [Cases](#org85cb9d1)
        3.  [Required Parameters](#org1efbbe3)
        4.  [Example](#org610ea69)
        5.  [Return Values](#orgfb17ecb)
    4.  [`Surah`](#org4e62617)
        1.  [Parameters](#org52454cc)
        2.  [Cases](#org39807cf)
        3.  [Default Value](#org513c63f)
        4.  [Required Parameters](#org23860e3)
        5.  [Example](#org06b7d42)
        6.  [Return Value](#org3fcef70)
        7.  [Note](#orgcbfff20)
    5.  [`Ayah`](#orgb1e33e7)
        1.  [Parameters](#org2721bf8)
        2.  [Cases](#org8086a37)
        3.  [Required Parameters](#org3e1f553)
        4.  [Example](#org390c978)
        5.  [Return Value](#org5dbb424)
        6.  [Note](#orgae1dd97)
    6.  [`Search`](#org9481938)
        1.  [Parameters](#orgfbe0fb5)
        2.  [Cases](#org0176306)
        3.  [Required Parameters](#org71971d5)
        4.  [Example](#org6afed91)
        5.  [Return Value](#org8e51031)
    7.  [`Manzil`](#orge8eaaaa)
        1.  [Parameters](#org438f742)
        2.  [Cases](#org60a0354)
        3.  [Required Parameters](#org8bffca9)
        4.  [Example](#org4c1fb27)
        5.  [Return Values](#orga67ee38)
    8.  [`Ruku`](#org56e7e00)
        1.  [Parameters](#org0ccdf96)
        2.  [Cases](#org8218490)
        3.  [Required Parameters](#orgff4b646)
        4.  [Example](#org00f99a1)
        5.  [Return Values](#org48a69bf)
    9.  [`Page`](#orgb7926e0)
        1.  [Parameters](#org27ba7a9)
        2.  [Cases](#orgb4ca2a4)
        3.  [Required Parameters](#org573481a)
        4.  [Example](#org9e1b9fe)
        5.  [Return Values](#org85c004f)
    10. [`Hizb`](#org4d0ef37)
        1.  [Parameters](#org8daecb2)
        2.  [Cases](#orgd74c026)
        3.  [Required Parameters](#org205d3f0)
        4.  [Example](#org207c1b5)
        5.  [Return Values](#org57869b9)
    11. [`Sajda`](#org636e543)
        1.  [Parameters](#org5f44890)
        2.  [Cases](#orgf996894)
        3.  [Required Parameters](#org21624a9)
        4.  [Example](#org1f00144)
        5.  [Return Values](#org315ba72)
4.  [Improve Documentation](#org8d3446f)
5.  [Add Unit Testing Class](#orgec103cb)
6.  [Note About `Meta`](#org9391237)



<a id="org806e01c"></a>

# Alquran

.NET lightweight Quran library using the alquran.cloud v1 APIs.

-   Dependencies:
    -   [RestSharp](https://www.nuget.org/packages/RestSharp/) (>= 107.3.0)
    -   [RestSharp.Serializers.NewtonsoftJson](https://www.nuget.org/packages/RestSharp.Serializers.NewtonsoftJson/) (>= 107.3.0)

This release was built using .NET 6


<a id="orgced1d89"></a>

# Demo

    using alquran;
    var e1 = AlQuranV1.Quran(); //getting all of Quran
    var e2 = AlQuranV1.Quran("en.asad "); //getting Muhammad Asad's edition of the Holy Quran
    var e3 = AlQuranV1.Quran("ar.alafasy "); // getting Mishary Alafasy's recitation of the Quran


<a id="orge055cb5"></a>

# Usage


<a id="orge6a121a"></a>

## `Edition`

All calls of this methods give you an IEnumerable object of editions describing the filte
editions. From this object, you need to use the identifier to get data from other endpoints
in this API. For any of the endpoints that require an edition identifier, if you do not
specify one, &rsquo;quran-uthmani&rsquo; is used and returns the Arabic text of the Holy Quran.

    IEnumerable<Edition>? Editions(string format, string lang, string type)


<a id="org1dcf1dd"></a>

### Parameters

-   `format`: specify a format. &rsquo;text&rsquo; or &rsquo;audio.
-   `lang`:  a 2 digit language code. Example: &rsquo;en&rsquo;, &rsquo;fr&rsquo;, etc.
-   `type`: a valid type. Example - &rsquo;versebyverse&rsquo;, &rsquo;translation&rsquo; etc.


<a id="orge3fc819"></a>

### Cases

Lists all editions for a given language:

    IEnumerable<Edition>? Editions(string lang)

Lists all editions for a given format:

    IEnumerable<Edition>? Editions(string format)

Lists all editions for a given type:

    IEnumerable<Edition>? Editions(string type)


<a id="org4deb4dd"></a>

### Required Parameters

None


<a id="orgc727dd9"></a>

### Default Values

Returns a list of all available editions


<a id="org1f0ef2b"></a>

### Example

    var e = AlQuranV1.Editions("audio", "fr", "versebyverse") // Lists all audio editions in french of the versebyverse type


<a id="orgc95d711"></a>

### Return Type

This methods always returns an `IEnumerable<edition>`


<a id="orgb6ea504"></a>

## `Quran`

Returns a complete Quran edition in the audio or text format

    Quran? Quran(string edition)


<a id="orgfec799b"></a>

### Parameters

-   `edition`: an edition identifier. Example: en.asad for Muhammad Asad&rsquo;s english translation


<a id="org995c4a4"></a>

### Cases

    Quran? Quran()

Returns the text of the Holy Quran in the quran-uthmani edition.

    Quran? Quran(string edition)

Returns a complete Quran edition.


<a id="orgf1c4d40"></a>

### Default Values

Returns the text of the Holy Quran in the quran-uthmani edition.


<a id="org5e7585c"></a>

### Required Parameters

None


<a id="orgc2aac94"></a>

### Example

    var e1 = AlQuranV1.Quran(); // Returns Muhammad Asad's translation of the Holy Quran
    var e2 = AlQuranV1.Quran("en.asad "); // Returns the text of the Holy Quran
    var e3 = AlQuranV1.Quran("ar.alafasy "); // Returns Mishary Alafasy's recitation of the Quran


<a id="orgf3becbc"></a>

### Return Type

An object of type `Quran`


<a id="orgba48ee0"></a>

## `Juz`

The Quran has 30 Juz. You can get the text for each Juz using the method below.

    Juz? Juz(int juz, string edition, int offset, int limit)


<a id="orga7d0dc8"></a>

### Parameters

-   `juz`: number of juz.
-   `edition`: an edition identifier. Example: en.asad for Muhammad Asad&rsquo;s english translation.
-   `offset`:  offset ayahs in a juz by the given number.
-   `limit`: number of ayahs that the response will be limited to.


<a id="org85cb9d1"></a>

### Cases

    Juz? Juz(int juz, string edition)

Returns an object of `juz` from edition `edition` of the Holy Quran

    Juz? Juz(int juz, string edition, int offset, int limit)


<a id="org1efbbe3"></a>

### Required Parameters

-   `juz`: number of juz


<a id="org610ea69"></a>

### Example

    var e1 = AlQuranV1.Juz(30, "en.asad");
    var e2 = AlQuranV1.Juz(30, "quran-uthmani");
    var e3 = AlQuranV1.Juz(1, "quran-uthmani", 3, 10);


<a id="orgfb17ecb"></a>

### Return Values

An object of type `Juz`


<a id="org4e62617"></a>

## `Surah`

Get a single Surah in one object or in a list with its other ports in other editions of the
Holy Quran.

    object? Surah(int surah, string edition, int offset, int limit)


<a id="org52454cc"></a>

### Parameters

-   `surah`: number of surah
-   `edition`: an edition identifier. Example: en.asad for Muhammad Asad&rsquo;s english translation.
-   `offset`:  offset ayahs in a juz by the given number.
-   `limit`: number of ayahs that the response will be limited to.


<a id="org39807cf"></a>

### Cases

    object? Surah(int surah , string edition , int offset , int limit )

Returns an object (castable to `Surah` object) of the Surah with number `surah`, edition
`edition` and offset `offset` to the limit `limit`.

    object? Surah(int surah)

Returns an object (castable to `Surah` object) of Surah with number `surah` and edition
`quran-simple`. It will return an object castable to `IEnumerable<Surah>` if `edition` is
more than 1 edition.

    object? Surah()

Returns an object (castable to `IEnumerable<Surah>` object) of all Surahs of the holy Quran


<a id="org513c63f"></a>

### Default Value

Returns an object (castable to `IEnumerable<Surah>` object) of all Surahs of the holy Quran


<a id="org23860e3"></a>

### Required Parameters

None


<a id="org06b7d42"></a>

### Example

    var e1 = AlQuranV1.Surah() as IEnumerable<Surah>; // all Surahs of Quran
    var e2 = AlQuranV1.Surah(114, "ar.alafasy") as Surah; // Returns Mishary Alafasy's recitation of Surat An-Naas
    var e3 = AlQuranV1.Surah(3, offset: 4, limit: 7) as Surah; // - Returns verses 2-4 of Surah Al-Fatiha
    var e4 = AlQuranV1.Surah(114, "quran-uthmani,en.asad,en.pickthall") as IEnumerable<Surah>; //  Returns Surat An-Naas from 3 editions: Simple Quran, Muhammad Asad and Marmaduke Pickthall


<a id="org3fcef70"></a>

### Return Value

`object?`


<a id="orgcbfff20"></a>

### Note

Since the `Surah` API may return a single Surah, as in example `e2` as well it might
returns a list of Surahs, as in examples e1, e4, it return an object type which can be
safely casted to whichever type.


<a id="orgb1e33e7"></a>

## `Ayah`

Get a single Ayah in one object or in a list with its other ports in other editions of the
Holy Quran.

    object? Ayah(int ayah, string edition = "")
    object? Ayah(int surah, int ayah, string edition = "")
