README.org
*** Cases
#+begin_src csharp
Ayah(int ayah, string edition = "")
#+end_src

Returns an object (castable to ~Ayah~ object) of the Ayah with number ~ayah~, edition
~edition~.

#+begin_src csharp
Ayah(int ayah)
#+end_src

Returns an object (castable to ~ayah~ object) of ayah with number ~ayah~ and edition ~quran-simple~

#+begin_src csharp
object? Ayah(int surah, int ayah, string edition = "")
#+end_src

Returns an object (castable to ~IEnumerable<Surah>~ object) of all Surahs of the holy Quran
*** Required Parameters
+ ~ayah~: number of ayah
+ ~surah~: number of surah
*** Example
#+begin_src csharp
var e1 = AlQuranV1.Ayah(262) as Ayah; // Returns Muhammad Asad's translation Ayat Al Kursi
var e2 = AlQuranV1.Ayah(2, 255) as Ayah; // Returns Muhammad Asad's translation Ayat Al Kursi
var e3 = AlQuranV1.Ayah(262, "ar.alafasy") as Ayah; // Returns Mishary Alafasy's recitation of the Ayat Al Kursi
var e4 = AlQuranV1.Ayah(262, "quran-uthmani,en.asad,en.pickthall") as IEnumerable<Ayah>; // Returns Ayat Al Kursi from 3 editions: Simple Quran, Muhammad Asad and Maramduke Pickthall
#+end_src
*** Return Value
~object?~
*** Note
Since the ~ayah~ API may return a single Surah, as in example ~e2~ as well it might
returns a list of Ayahs, as in examples e1, e4, it return an object type which can be
safely casted to whichever type.
** ~Search~
Search the Holy Quran. Please note that only text editions of the Quran are searchable.
#+begin_src csharp
SearchResult? Search(string keyword, string editionOrLanguage, int surah)
#+end_src
*** Parameters
+ ~keyword~ the keyword to seach for
+ ~surah~ number of surah
+ ~editionOrLanguage~ an edition identifier. Example: en.asad for Muhammad Asad's english translation. or an language identifier. Example: en for english, ar for Arabic

*** Cases
#+begin_src csharp
SearchResult? Search(string keyword, string editionOrLanguage, int surah)
#+end_src
Returns and object of ~SearchResult~ with results of searching in edition[or, editions of
the language] ~editionOrLanguage~, only in Surah with number ~surah~

#+begin_src csharp
SearchResult? Search(string keyword, string editionOrLanguage)
#+end_src
Returns and object of ~SearchResult~ with results of searching in edition[or, editions of
the language] ~editionOrLanguage~

*** Required Parameters
+ ~keyword~: the keyword to seach for
+ ~editionOrLanguage~: an edition identifier. Example: en.asad for Muhammad Asad's english translation. or an language identifier. Example: en for english, ar for Arabic

*** Example
#+begin_src csharp
var e1 = AlQuranV1.Search("Abraham", "en"); //  Returns all ayahs that contain the word 'Abraham' in all the english editions
var e2 = AlQuranV1.Search("Abraham", "en.pickthall"); // Returns all ayahs that contain the word 'Abraham' in Maramduke Pickthall's English translation
var e3 = AlQuranV1.Search("Abraham", "en.pickthall", 37); // Returns all ayahs that contain the word 'Abraham' Surat As-Saafaat in Maramduke Pickthall's English translation
#+end_src

*** Return Value
~SearchResult?~

** ~Manzil~
The Quran has 7 Manzils (for those who want to read / recite it over one week). You can get
the text for each Manzil using this method.
#+begin_src csharp
Manzil? Manzil(int manzil, string edition, int offset = -99, int limit = -99)
#+end_src
*** Parameters
+ ~manzil~: number of manzil.
+ ~edition~: an edition identifier. Example: en.asad for Muhammad Asad's english translation.
+ ~offset~:  offset ayahs in a juz by the given number.
+ ~limit~: number of ayahs that the response will be limited to.
*** Cases
#+begin_src csharp
Manzil? Manzil(int manzil, string edition)
#+end_src
Returns an object of ~manzil~ from edition ~edition~ of the Holy Quran
#+begin_src csharp
Manzil? Manzil(int manzil, string edition, int offset, int limit)
#+end_src
*** Required Parameters
+ ~manzil~: number of manzil
*** Example
#+begin_src csharp
var e1 = AlQuranV1.Manzil(7, "en.asad "); // Returns manzil 7 from Muhammad Asad's translation of the Holy Quran
var e2 = AlQuranV1.Manzil(7, "quran-uthmani"); // Returns the text of Manzil 7 of the Holy Quran
var e3 = AlQuranV1.Manzil(7, "quran-uthmani", 3, 10); // Returns the the ayahs 4-13 from Manzil 7
#+end_src
*** Return Values
An object of type ~manzil~
** ~Ruku~
The Quran has 556 Rukus. You can get the text for each Ruku using the method below.
#+begin_src csharp
Ruku? Ruku(int ruku, string edition, int offset = -99, int limit = -99)
#+end_src
*** Parameters
+ ~ruku~: number of ruku.
+ ~edition~: an edition identifier. Example: en.asad for Muhammad Asad's english translation.
+ ~offset~:  offset ayahs in a juz by the given number.
+ ~limit~: number of ayahs that the response will be limited to.
*** Cases
#+begin_src csharp
Ruku? Ruku(int ruku, string edition)
#+end_src
Returns an object of ~Ruku~ from edition ~edition~ of the Holy Quran
#+begin_src csharp
Ruku? Ruku(int manzil, string edition, int offset, int limit)
#+end_src
*** Required Parameters
+ ~ruku~: number of manzil
*** Example
#+begin_src csharp
var e1 = AlQuranV1.Ruku(7, "en.asad"); // Returns ruku 7 from Muhammad Asad's translation of the Holy Quran
var e2 = AlQuranV1.Ruku(7, "quran-uthmani"); // Returns the text of ruku 7 of the Holy Quran
var e3 = AlQuranV1.Ruku(7, "quran-uthmani", 3, 3); // Returns the the ayahs 4-6 from ruku 7
#+end_src
*** Return Values
An object of type ~Ruku~


** ~Page~
The Quran is traditionally printed / written on 604 pages. You can get the text for each
page using the method below.
#+begin_src csharp
Page? Page(int page, string edition, int offset = -99, int limit = -99)
#+end_src
*** Parameters
+ ~page~: number of page.
+ ~edition~: an edition identifier. Example: en.asad for Muhammad Asad's english translation.
+ ~offset~:  offset ayahs in a juz by the given number.
+ ~limit~: number of ayahs that the response will be limited to.
*** Cases
#+begin_src csharp
Page? Page(int page, string edition)
#+end_src
Returns an object of ~Page~ from edition ~edition~ of the Holy Quran
#+begin_src csharp
Page? Page(int page, string edition, int offset, int limit)
#+end_src

*** Required Parameters
+ ~page~: number of page
*** Example
#+begin_src csharp
var e1 = AlQuranV1.Page(1, "en.asad "); // Returns page 1 from Muhammad Asad's translation of the Holy Quran
var e2 = AlQuranV1.Page(1, "quran-uthmani"); // Returns the text of page 1 of the Holy Quran
var e3 = AlQuranV1.Page(1, "quran-uthmani", 2, 2); // Returns the the ayahs 3-4 from page 1
#+end_src
*** Return Values
An object of type ~Page~




** ~Hizb~
The Quran comprises 240 Hizb Quarters. One Hizb is half a Juz.
#+begin_src csharp
Hizb? Hizb(int hizb, string edition, int offset = -99, int limit = -99)
#+end_src
*** Parameters
+ ~hizb~: number of hizb.
+ ~edition~: an edition identifier. Example: en.asad for Muhammad Asad's english translation.
+ ~offset~:  offset ayahs in a juz by the given number.
+ ~limit~: number of ayahs that the response will be limited to.
*** Cases
#+begin_src csharp
Hizb? Hizb(int hizb, string edition)
#+end_src
Returns an object of ~Hizb~ from edition ~edition~ of the Holy Quran
#+begin_src csharp
Hizb? Ruku(int hizv, string edition, int offset, int limit)
#+end_src

*** Required Parameters
+ ~hizb~: number of hizb
*** Example
#+begin_src csharp
var e1 = AlQuranV1.Hizb(7, "en.asad "); // Returns hizb quarter 1 from Muhammad Asad's translation of the Holy Quran
var e2 = AlQuranV1.Hizb(7, "quran-uthmani"); // Returns the text of hizb quarater 1 of the Holy Quran
var e3 = AlQuranV1.Hizb(7, "quran-uthmani", 2, 2); // Returns the the ayahs 3-4 from hizb Quarter 1
#+end_src
