README.md


<a id="org2721bf8"></a>

### Parameters

-   `ayah`: number of ayah
-   `surah`: number of surah
-   `edition`: an edition identifier. Example: en.asad for Muhammad Asad&rsquo;s english translation.
-   `offset`:  offset ayahs in a juz by the given number.
-   `limit`: number of ayahs that the response will be limited to.


<a id="org8086a37"></a>

### Cases

    Ayah(int ayah, string edition = "")

Returns an object (castable to `Ayah` object) of the Ayah with number `ayah`, edition
`edition`.

    Ayah(int ayah)

Returns an object (castable to `ayah` object) of ayah with number `ayah` and edition `quran-simple`

    object? Ayah(int surah, int ayah, string edition = "")

Returns an object (castable to `IEnumerable<Surah>` object) of all Surahs of the holy Quran


<a id="org3e1f553"></a>

### Required Parameters

-   `ayah`: number of ayah
-   `surah`: number of surah


<a id="org390c978"></a>

### Example

    var e1 = AlQuranV1.Ayah(262) as Ayah; // Returns Muhammad Asad's translation Ayat Al Kursi
    var e2 = AlQuranV1.Ayah(2, 255) as Ayah; // Returns Muhammad Asad's translation Ayat Al Kursi
    var e3 = AlQuranV1.Ayah(262, "ar.alafasy") as Ayah; // Returns Mishary Alafasy's recitation of the Ayat Al Kursi
    var e4 = AlQuranV1.Ayah(262, "quran-uthmani,en.asad,en.pickthall") as IEnumerable<Ayah>; // Returns Ayat Al Kursi from 3 editions: Simple Quran, Muhammad Asad and Maramduke Pickthall


<a id="org5dbb424"></a>

### Return Value

`object?`


<a id="orgae1dd97"></a>

### Note

Since the `ayah` API may return a single Surah, as in example `e2` as well it might
returns a list of Ayahs, as in examples e1, e4, it return an object type which can be
safely casted to whichever type.


<a id="org9481938"></a>

## `Search`

Search the Holy Quran. Please note that only text editions of the Quran are searchable.

    SearchResult? Search(string keyword, string editionOrLanguage, int surah)


<a id="orgfbe0fb5"></a>

### Parameters

-   `keyword` the keyword to seach for
-   `surah` number of surah
-   `editionOrLanguage` an edition identifier. Example: en.asad for Muhammad Asad&rsquo;s english translation. or an language identifier. Example: en for english, ar for Arabic


<a id="org0176306"></a>

### Cases

    SearchResult? Search(string keyword, string editionOrLanguage, int surah)

Returns and object of `SearchResult` with results of searching in edition[or, editions of
the language] `editionOrLanguage`, only in Surah with number `surah`

    SearchResult? Search(string keyword, string editionOrLanguage)

Returns and object of `SearchResult` with results of searching in edition[or, editions of
the language] `editionOrLanguage`


<a id="org71971d5"></a>

### Required Parameters

-   `keyword`: the keyword to seach for
-   `editionOrLanguage`: an edition identifier. Example: en.asad for Muhammad Asad&rsquo;s english translation. or an language identifier. Example: en for english, ar for Arabic


<a id="org6afed91"></a>

### Example

    var e1 = AlQuranV1.Search("Abraham", "en"); //  Returns all ayahs that contain the word 'Abraham' in all the english editions
    var e2 = AlQuranV1.Search("Abraham", "en.pickthall"); // Returns all ayahs that contain the word 'Abraham' in Maramduke Pickthall's English translation
    var e3 = AlQuranV1.Search("Abraham", "en.pickthall", 37); // Returns all ayahs that contain the word 'Abraham' Surat As-Saafaat in Maramduke Pickthall's English translation


<a id="org8e51031"></a>

### Return Value

`SearchResult?`


<a id="orge8eaaaa"></a>

## `Manzil`

The Quran has 7 Manzils (for those who want to read / recite it over one week). You can get
the text for each Manzil using this method.

    Manzil? Manzil(int manzil, string edition, int offset = -99, int limit = -99)


<a id="org438f742"></a>

### Parameters

-   `manzil`: number of manzil.
-   `edition`: an edition identifier. Example: en.asad for Muhammad Asad&rsquo;s english translation.
-   `offset`:  offset ayahs in a juz by the given number.
-   `limit`: number of ayahs that the response will be limited to.


<a id="org60a0354"></a>

### Cases

    Manzil? Manzil(int manzil, string edition)

Returns an object of `manzil` from edition `edition` of the Holy Quran

    Manzil? Manzil(int manzil, string edition, int offset, int limit)


<a id="org8bffca9"></a>

### Required Parameters

-   `manzil`: number of manzil


<a id="org4c1fb27"></a>

### Example

    var e1 = AlQuranV1.Manzil(7, "en.asad "); // Returns manzil 7 from Muhammad Asad's translation of the Holy Quran
    var e2 = AlQuranV1.Manzil(7, "quran-uthmani"); // Returns the text of Manzil 7 of the Holy Quran
    var e3 = AlQuranV1.Manzil(7, "quran-uthmani", 3, 10); // Returns the the ayahs 4-13 from Manzil 7


<a id="orga67ee38"></a>

### Return Values

An object of type `manzil`


<a id="org56e7e00"></a>

## `Ruku`

The Quran has 556 Rukus. You can get the text for each Ruku using the method below.

    Ruku? Ruku(int ruku, string edition, int offset = -99, int limit = -99)


<a id="org0ccdf96"></a>

### Parameters

-   `ruku`: number of ruku.
-   `edition`: an edition identifier. Example: en.asad for Muhammad Asad&rsquo;s english translation.
-   `offset`:  offset ayahs in a juz by the given number.
-   `limit`: number of ayahs that the response will be limited to.


<a id="org8218490"></a>

### Cases

    Ruku? Ruku(int ruku, string edition)

Returns an object of `Ruku` from edition `edition` of the Holy Quran

    Ruku? Ruku(int manzil, string edition, int offset, int limit)


<a id="orgff4b646"></a>

### Required Parameters

-   `ruku`: number of manzil


<a id="org00f99a1"></a>

### Example

    var e1 = AlQuranV1.Ruku(7, "en.asad"); // Returns ruku 7 from Muhammad Asad's translation of the Holy Quran
    var e2 = AlQuranV1.Ruku(7, "quran-uthmani"); // Returns the text of ruku 7 of the Holy Quran
    var e3 = AlQuranV1.Ruku(7, "quran-uthmani", 3, 3); // Returns the the ayahs 4-6 from ruku 7


<a id="org48a69bf"></a>

### Return Values

An object of type `Ruku`


<a id="orgb7926e0"></a>

## `Page`

The Quran is traditionally printed / written on 604 pages. You can get the text for each
page using the method below.

    Page? Page(int page, string edition, int offset = -99, int limit = -99)


<a id="org27ba7a9"></a>

### Parameters

-   `page`: number of page.
-   `edition`: an edition identifier. Example: en.asad for Muhammad Asad&rsquo;s english translation.
-   `offset`:  offset ayahs in a juz by the given number.
-   `limit`: number of ayahs that the response will be limited to.


<a id="orgb4ca2a4"></a>

### Cases

    Page? Page(int page, string edition)

Returns an object of `Page` from edition `edition` of the Holy Quran

    Page? Page(int page, string edition, int offset, int limit)


<a id="org573481a"></a>

### Required Parameters

-   `page`: number of page


<a id="org9e1b9fe"></a>

### Example

    var e1 = AlQuranV1.Page(1, "en.asad "); // Returns page 1 from Muhammad Asad's translation of the Holy Quran
    var e2 = AlQuranV1.Page(1, "quran-uthmani"); // Returns the text of page 1 of the Holy Quran
    var e3 = AlQuranV1.Page(1, "quran-uthmani", 2, 2); // Returns the the ayahs 3-4 from page 1


<a id="org85c004f"></a>

### Return Values

An object of type `Page`


<a id="org4d0ef37"></a>

## `Hizb`

The Quran comprises 240 Hizb Quarters. One Hizb is half a Juz.

    Hizb? Hizb(int hizb, string edition, int offset = -99, int limit = -99)


<a id="org8daecb2"></a>

### Parameters

-   `hizb`: number of hizb.
-   `edition`: an edition identifier. Example: en.asad for Muhammad Asad&rsquo;s english translation.
-   `offset`:  offset ayahs in a juz by the given number.
-   `limit`: number of ayahs that the response will be limited to.


<a id="orgd74c026"></a>

### Cases

    Hizb? Hizb(int hizb, string edition)

Returns an object of `Hizb` from edition `edition` of the Holy Quran

    Hizb? Ruku(int hizv, string edition, int offset, int limit)


<a id="org205d3f0"></a>

### Required Parameters

-   `hizb`: number of hizb


<a id="org207c1b5"></a>

### Example

    var e1 = AlQuranV1.Hizb(7, "en.asad "); // Returns hizb quarter 1 from Muhammad Asad's translation of the Holy Quran
    var e2 = AlQuranV1.Hizb(7, "quran-uthmani"); // Returns the text of hizb quarater 1 of the Holy Quran
    var e3 = AlQuranV1.Hizb(7, "quran-uthmani", 2, 2); // Returns the the ayahs 3-4 from hizb Quarter 1
