README.org
*** Return Values
An object of type ~Hizb~

** ~Sajda~
Depending on the madhab, there can be 14, 15 or 16 sajdas. This API has 15.
#+begin_src csharp
(IEnumerable<Ayah>, Edition) Sajda(string edition)
#+end_src
*** Parameters
+ ~edition~: an edition identifier. Example: en.asad for Muhammad Asad's english translation.
*** Cases
#+begin_src csharp
(IEnumerable<Ayah>, Edition) Sajda(string edition)
#+end_src
Returns a tuple of ~IEnumerable<Ayah>~ and ~Edition~ contains Sajdas of the edition and
metadata about the edition, respectively.
#+begin_src csharp
(IEnumerable<Ayah>, Edition) Sajda()
#+end_src
Returns a tuple of ~IEnumerable<Ayah>~ and ~Edition~ contains Sajdas of the edition and
metadata about the quran-simple edition.
*** Required Parameters
None.
*** Example
#+begin_src csharp
var e1 = AlQuranV1.Sajda("en.asad "); // Returns the text of sajda ayahs of the Holy Quran
#+end_src
*** Return Values
An object of type ~(IEnumerable<Ayah>, Edition)~

* TODO Improve Documentation
* TODO Add Unit Testing Class
* Note About ~Meta~
I did not implement an interface for the meta API (~http://api.alquran.cloud/v1/meta~), and
I'm not sure of adding 'yet', because of: 1. It seems useless since all the metadata can be
concatenated throw the AlquranV1 methods, using an extention method for example. 2. It is
too complex type to bind.
