README.md


<a id="org57869b9"></a>

### Return Values

An object of type `Hizb`


<a id="org636e543"></a>

## `Sajda`

Depending on the madhab, there can be 14, 15 or 16 sajdas. This API has 15.

    (IEnumerable<Ayah>, Edition) Sajda(string edition)


<a id="org5f44890"></a>

### Parameters

-   `edition`: an edition identifier. Example: en.asad for Muhammad Asad&rsquo;s english translation.


<a id="orgf996894"></a>

### Cases

    (IEnumerable<Ayah>, Edition) Sajda(string edition)

Returns a tuple of `IEnumerable<Ayah>` and `Edition` contains Sajdas of the edition and
metadata about the edition, respectively.

    (IEnumerable<Ayah>, Edition) Sajda()

Returns a tuple of `IEnumerable<Ayah>` and `Edition` contains Sajdas of the edition and
metadata about the quran-simple edition.


<a id="org21624a9"></a>

### Required Parameters

None.


<a id="org1f00144"></a>

### Example

    var e1 = AlQuranV1.Sajda("en.asad "); // Returns the text of sajda ayahs of the Holy Quran


<a id="org315ba72"></a>

### Return Values

An object of type `(IEnumerable<Ayah>, Edition)`


<a id="org8d3446f"></a>

# TODO Improve Documentation


<a id="orgec103cb"></a>

# TODO Add Unit Testing Class


<a id="org9391237"></a>

# Note About `Meta`

I did not implement an interface for the meta API (`http://api.alquran.cloud/v1/meta`), and
I&rsquo;m not sure of adding &rsquo;yet&rsquo;, because of: 1. It seems useless since all the metadata can be
concatenated throw the AlquranV1 methods, using an extention method for example. 2. It is
too complex type to bind.

